list = [1,5,8,4,2]
print(sorted(list))



"""
{
  "algorithm": "OCR",
  "box": [
    1214,
    672,
    51,
    26
  ],
  "detail": {
    "all": [
      {
        "box": [
          1214,
          672,
          51,
          26
        ],
        "score": 0.988173,
        "text": "竞技"
      }
    ],
    "best": {
      "box": [
        1214,
        672,
        51,
        26
      ],
      "score": 0.988173,
      "text": "竞技"
    },
    "filtered": [
      {
        "box": [
          1214,
          672,
          51,
          26
        ],
        "score": 0.988173,
        "text": "竞技"
      }
    ]
  },
  "detailJson": "{\"all\":[{\"box\":[1214,672,51,26],\"score\":0.988173,\"text\":\"竞技\"}],\"best\":{\"box\":[1214,672,51,26],\"score\":0.988173,\"text\":\"竞技\"},\"filtered\":[{\"box\":[1214,672,51,26],\"score\":0.988173,\"text\":\"竞技\"}]}",
  "drawImageRefs": [
    "ff39f676-7acf-4782-9195-f84573fe2bd2"
  ],
  "hit": true,
  "id": 400000038,
  "name": "进入竞技场",
  "screenshotRef": "ff39f676-7acf-4782-9195-f84573fe2bd2"
}

FULL_FACE = {
    # 全屏覆盖类界面
    # "角色": 200,# 主界面esc的领主界面
    "设置": 201,
    "领主时装": 202,
    "领主": 203,
    "增加天赋加点": 204,
    "装扮": 205,
    "转换角色性别": 206,
    "我的庄园": 207,
    "市政办公室": 208,
    "成就": 209,
    "道具宝鉴": 210,
    "英雄宝鉴": 211,
    "排行榜": 212,
    "英雄皮肤收集": 213,
    "天赋力": 214,
    "任务": 215,
    "科技": 216,
    "招募": 217,
    "制造": 218,
    "邮件": 219,
    "联盟中心": 220,
    "英雄": 221,
    "编队": 222,
    "召唤": 223,
    "背包": 224,
    "技能库": 225,
    "冒险": 226,
    "竞技": 227,
    "盛宴": 228,
    "交易所": 229,
    "市场": 230,
    "活动": 231,
    "商城": 232,
    "藏宝洞": 233,
    "记忆空间": 234,
    "荒原": 235,
    "遗迹": 236,
    "领主考核": 237,
    "幻想广场": 238,#特殊，该界面和答题冲突
    "挑战领主": 239,
    "深渊": 240,
    "世界首领": 241,
    "世界首领-个人版": 242,
    "魔法园": 243,
    "世界地图": 244,
}
ELSE_FACE = {
    "加载": 999,
    "其他": 998,
    "登录": 1,
    "角色列表": 2,
    "主界面": 101,
    "角色": 102,# 主界面esc的领主界面 ！！！特殊界面
    # 弹窗类界面
    "资源转换": 301,
    "兑换码": 302,
    "bug反馈": 303,
    "好友": 304,
    "聊天": 305,
    "建造": 306,
    "特产运输": 307,

    #弹窗可×
    "知识问答": 401,
}
"""